# DimStyleDimLineSnapDist Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimStyleDimLineSnapDist Property
ParameterTypeId Class See Also
---
"Dimension Line Snap Distance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimStyleDimLineSnapDist { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimStyleDimLineSnapDist As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimStyleDimLineSnapDist {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace